Repository: 1-0/SelectX
Catalog: locale/*/LC_MESSAGES/SelectX.po
Languages: ru_ua

source: Try to use PyQt4 (license - http://www.riverbankcomputing.co.uk/software/pyqt/license ) instead of PySide (license - LGPL - http://www.gnu.org/copyleft/lesser.html )
ru_ua: Попытка использовать PyQt4 (лицензия - http://www.riverbankcomputing.co.uk/software/pyqt/license ) вместо PySide (лицензия - LGPL - http://www.gnu.org/copyleft/lesser.html )

source: Keypresses: Action: Backspace Deletes the character to the left of the cursor. Delete Deletes the character to the right of the cursor. Ctrl+C Copy the selected text to the clipboard. Ctrl+Insert Copy the selected text to the clipboard. Ctrl+K Deletes to the end of the line. Ctrl+V Pastes the clipboard text into text edit. Shift+Insert Pastes the clipboard text into text edit. Ctrl+X Deletes the selected text and copies it to the clipboard. Shift+Delete Deletes the selected text and copies it to the clipboard. Ctrl+Z Undoes the last operation. Ctrl+Y Redoes the last operation. LeftArrow Moves the cursor one character to the left. Ctrl+LeftArrow Moves the cursor one word to the left. RightArrow Moves the cursor one character to the right. Ctrl+RightArrow Moves the cursor one word to the right. UpArrow Moves the cursor one line up. Ctrl+UpArrow Moves the cursor one word up. DownArrow Moves the cursor one line down. Ctrl+Down Arrow Moves the cursor one word down. PageUp Moves the cursor one page up. PageDown Moves the cursor one page down. Home Moves the cursor to the beginning of the line. Ctrl+Home Moves the cursor to the beginning of the text. End Moves the cursor to the end of the line. Ctrl+End Moves the cursor to the end of the text. Alt+Wheel Scrolls the page horizontally (the Wheel is the mouse wheel). Ctrl+Wheel Zooms the text.
ru_ua: Нажатая клавиша: Действие: Backspace Удаляет символ слева от курсора. Delete Удаляет символ справа от курсора. Ctrl+C Копирует выбранный текст в буфер обмена. Ctrl+Insert Копирует выбранный текст в буфер обмена. Ctrl+K Удаляет до конца строки. Ctrl+V Вставляет текст в текстовый редактор. Shift+Insert Вставляет текст в текстовый редактор. Ctrl+X Удаляет выбранный текст и копирует его в буфер обмена. Shift+Delete Удаляет выбранный текст и копирует его в буфер обмена. Ctrl+Z Отменяет последнее действие. Ctrl+Y Выполняет последнее действие. СтрелкаВлево Передвигает курсор на один символ влево. Ctrl+СтрелкаВлево Передвигает курсор на одно слово влево. СтрелкаВправо Передвигает курсор на один символ вправо. Ctrl+СтрелкаВправо Передвигает курсор на одно слово вправо. СтрелкаВверх Передвигает курсор на одну строку вверх. Ctrl+СтрелкаВверх Передвигает курсор на одно слово вверх. СтрелкаВниз Передвигает курсор на одну строку вниз. Ctrl+СтрелкаВниз Передвигает курсор на одно слово вниз. PageUp Передвигает курсор на одну страницу вверх. PageDown Передвигает курсор на одну страницу вниз. Home Передвигает курсор в начало строки. Ctrl+Home Передвигает курсор в начало текста. End Передвигает курсор в конец строки. Ctrl+End Передвигает курсор в конец текста. Alt+Колесо Прокручивает страницу горизонтально (Колесо - колесо мышки). Ctrl+Колесо Масштабирует текст.

source: [KEY]...[FILE] Keys: --ForceEmbededIcons Use embeded icons theme -h, --help Print this help message --version Print version info
ru_ua: [КЛЮЧ]...[ФАЙЛ] Ключи: --ForceEmbededIcons Использовать встроенную тему иконок -h, --help Вывести это сообщение помощь --version Вывести информацию о версии

source: SelectX. Text editor licensed by GPL3. Ver. %s
ru_ua: SelectX. Текстовый редактор лицензированный по GPL3. Версия %s.

source: Try Open This File -> %s
ru_ua: Попытка открыть этот файл -> %s

source: Too many args
ru_ua: Слишком много параметров

source: New Text
ru_ua: Новый текст

source: File
ru_ua: Файл

source: &File
ru_ua: &Файл

source: New Tab
ru_ua: Новая вкладка

source: Create new tab
ru_ua: Создать новую вкладку

source: Open
ru_ua: Открыть

source: Open a file
ru_ua: Открыть файл

source: Save
ru_ua: Сохранить

source: Save current file
ru_ua: Сохранить текущий файл

source: Save As...
ru_ua: Сохранить как...

source: Save as new file
ru_ua: Сохранить как новый файл

source: Preview
ru_ua: Предпросмотр

source: File Preview
ru_ua: Предпросмотр файла

source: Print
ru_ua: Печать

source: File Print
ru_ua: Пачать файла

source: Close Tab
ru_ua: Закрыть вкладку

source: Close current tab
ru_ua: Закрыть текущую вкладку

source: Exit
ru_ua: Выход

source: Exit SelectX
ru_ua: Выйти из SelectX

source: Edit
ru_ua: Редактировать

source: &Edit
ru_ua: &Редактировать

source: Undo
ru_ua: Отменить

source: Undo last text edit
ru_ua: Отменить последнюю правку текста

source: Redo
ru_ua: Вернуть

source: Redo last text edit
ru_ua: Вернуть последнюю отмену правки текста

source: Copy
ru_ua: Копировать

source: Copy selected text
ru_ua: Копировать выделенный текст

source: Cut
ru_ua: Вырезать

source: Cut selected text
ru_ua: Вырезать выделенный текст

source: Paste
ru_ua: Вставить

source: Paste text
ru_ua: Вставить текст

source: Find and replace
ru_ua: Найти и заменить

source: Find and replace words in your document
ru_ua: Найти и заменить слова в Вашем документе

source: Select
ru_ua: Выбрать

source: &Select
ru_ua: Вы&брать

source: Select All
ru_ua: Выбрать всё

source: Select all text in editor
ru_ua: Выбрать весь текст в редакторе

source: Select For Copy By Words
ru_ua: Выбор для копирования по-словам

source: Set Select For Copy By Words
ru_ua: Задать выбор для копирования по-словам

source: View
ru_ua: Вид

source: &View
ru_ua: &Вид

source: &Highlighter
ru_ua: &Подсветка синтаксиса

source: None
ru_ua: Отсутствует

source: None Highlighter
ru_ua: Отсутствует подсветка синтаксиса

source: Cpp
ru_ua: С++

source: Cpp Highlighter
ru_ua: Подсветка синтаксиса С++

source: Python Highlighter
ru_ua: Подсветка синтаксиса Python

source: &Zoom
ru_ua: &Масштаб

source: Zoom In
ru_ua: Увеличить масштаб

source: Zoom In text in editor
ru_ua: Увеличить масштаб текста в редакторе

source: Zoom Out
ru_ua: Уменьшить масштаб

source: Zoom Out text in editor
ru_ua: Уменьшить масштаб текста в редакторе

source: Zoom Original
ru_ua: Начальный масштаб

source: Zoom original text in editor
ru_ua: Начальный масштаб текста в редакторе

source: Font
ru_ua: Шрифт

source: Font select dialog
ru_ua: Диалог выбора шрифта

source: Show/Hide non-printabale
ru_ua: Отобразить/спрятать непечатаемые

source: Show/Hide non-printabale symbols
ru_ua: Отобразить/спрятать непечатаемые символы

source: Pythonic Enter
ru_ua: "Pythonic" новой строки

source: On/Off Pythonic Enter Style
ru_ua: Включить/выключить "Pythonic" стиль новой строки

source: Line Numbers
ru_ua: Номерация строк

source: On/Off PLine Numbers
ru_ua: Включить/Выключить номерацию строк

source: Help
ru_ua: Помощь

source: &Help
ru_ua: &Помощь

source: Keys Help
ru_ua: Помощь по клавишам

source: About
ru_ua: О программе

source: About editor
ru_ua: О редакторе

source: About &Qt
ru_ua: О версии &Qt

source: About current QT
ru_ua: О текущей версии QT

source: Ok Player
ru_ua: Ok проигрыватель

source: On/Off Ok Player
ru_ua: Включить/выключить Ok проигрыватель

source: Ok Volume
ru_ua: Ok громкость

source: Volume Ok Player
ru_ua: Громкость Ok проигрывателя

source: Hide Py Enter
ru_ua: Выключить "Pythonic" новые строки

source: Add Py Enter
ru_ua: Включить "Pythonic" новые строки

source: New text - %s
ru_ua: Новый текст - %s

source: Selected Tab #%s
ru_ua: Выбрана вкладка №%s

source: Save Text: %s
ru_ua: Сохранение текста: %s

source: Save File
ru_ua: Сохранение файла

source: Stop Save Text
ru_ua: Прекращено сохранение текста

source: Open File
ru_ua: Открыть файл

source: All Files (*);;Text Files (*.txt *.log *.TXT *.LOG);;Python Files (*.py *.PY *.py3 *.PY3);;C/C++ Files (*.c *.cc *.cpp *.c++ *.cxx *.h *.hh *.hpp *.hxx *.CPP *.H *.c *.C)
ru_ua: Все файлы (*);;Текстовые файлы (*.txt *.log *.TXT *.LOG);;Python файлы (*.py *.PY *.py3 *.PY3);;C/C++ файлы(*.c *.cc *.cpp *.c++ *.cxx *.h *.hh *.hpp *.hxx *.CPP *.H *.c *.C)

source: Start reading: %s
ru_ua: Начато чтение: %s

source: Stop Open Text
ru_ua: Прекращено открытие текста

source: Open Text: %s
ru_ua: Открыть текст: %s

source: Confirm Exit SelectX
ru_ua: Подтвердить выход из SelectX

source: Are you sure to Exit?
ru_ua: Вы уверенны, что хотите выйти?

source: Close Stoped
ru_ua: Закрытие прекращено

source: Confirm Close Tab
ru_ua: Подтвердите закрытие вкладки

source: Are you sure to Close Tab?
ru_ua: Вы уверенны, что хотите закрыть вкладку?

source: Undo Text
ru_ua: Отмена текста

source: Redo Text
ru_ua: Возврат текста

source: Enter words number
ru_ua: Введите число слов

source: Enter words number for copy:
ru_ua: Введите число слов для копирования

source: Copy Text
ru_ua: Копирование текста

source: Cut Text
ru_ua: Вырезание текста

source: Paste Text
ru_ua: Вставка текста

source: Hide Non Printabale
ru_ua: Спрятать непечатаемые

source: Show Non Printabale
ru_ua: Показать непечатаемые

source: Show Line Numbers
ru_ua: Показать номера линий

source: Hide Line Numbers
ru_ua: Спрятать номера линий

source: SelectX Find Dialog
ru_ua: SelectX Диалог поиска

source: Enter text to find:
ru_ua: Введите текст для поиска:

source: Found: %s
ru_ua: Найдено: %s

source: Not found: %s
ru_ua: Не найдено: %s

source: Find Canceled
ru_ua: Поиск отменен

source: Zoom Rate: %s
ru_ua: Коэффициент масштабирования: %s

source: Enter media URL
ru_ua: Введите URL мультимедиа

source: Enter you favorit on-line radio URL:
ru_ua: Введите URL Вашей любимой он-лайн радиостанции

source: okPlayer play: %s
ru_ua: okPlayer проигрывает: %s

source: okPlayer stop
ru_ua: okPlayer остановлен

source: About SelectX
ru_ua: О SelectX

source: Keys SelectX
ru_ua: Клавиши SelectX

source: Symbols: {} | Rows: {} | Line: {} | Column: {} | Selected: {}
ru_ua: Символы: {} | Строки: {} | Строка: {} | Колонка: {} | Выбрано: {}

source: Symbols: {} | Rows: {} | Line: {} | Column: {}
ru_ua: Символы: {} | Строки: {} | Строка: {} | Колонка: {}

source: Set Ok
ru_ua: Установите Ok

source: Find
ru_ua: Найти

source: Replace
ru_ua: Заменить

source: Replace all
ru_ua: Заменить всё

source: Normal
ru_ua: Обычный

source: Options:
ru_ua: Параметры:

source: Case sensitive
ru_ua: Чувствительно к регистру

source: Whole words
ru_ua: Целое слово

source: Find and Replace
ru_ua: Найти и заменить
